Управление_закупками/src/Documents/РасширениеВнутреннегоЗаказа/РасширениеВнутреннегоЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасширениеВнутреннегоЗаказа</name>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗаказа</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/AccumulationRegisters/ОстатокПотребностиПоВнутреннимЗаказам/ОстатокПотребностиПоВнутреннимЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстатокПотребностиПоВнутреннимЗаказам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_закупками/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоставки</name>
    <type>
      <types>EnumRef.ВидПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяДокументация</name>
    <type>
      <types>CatalogRef.РабочаяДокументация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСогласованПТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказОтправленВОМТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЗаказаВОМТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправилВОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗаказа</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДляКорректировки</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/Documents/РасширениеВнутреннегоЗаказа/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда
		
		Автор = КадрыСервер.ТекущийСотрудник();
		
	КонецЕсли;
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		
		Основание = ДанныеЗаполнения.Ссылка;
				
	КонецЕсли;

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Если Товары.Количество() = 0 Тогда
		
		ТекстСообщения = "Документ не проведен. Табличная часть документа не может быть пустой.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"Товары",,Отказ);
		Возврат;
		
	КонецЕсли;  
	
	Если  Не ТабличнаяЧастьТоварыЗаполненаВерно() Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	ЗаписатьДвиженияВРегистрОстатокПотребностиПоВнутреннимЗаказам(Отказ);
				
КонецПроцедуры 


#КонецОбласти   


#Область СлужебныеПроцедурыИФункции

Функция ТабличнаяЧастьТоварыЗаполненаВерно()
	
	// Проверить строки с отрицательным количеством.
	// Эти строки обязательно должны быть в заказе - основании.
	
	ТабличнаяЧастьТоварыЗаполненаВерно = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасширениеВнутреннегоЗаказаТовары.Номенклатура КАК Номенклатура,
		|	РасширениеВнутреннегоЗаказаТовары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
		|	РасширениеВнутреннегоЗаказаТовары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмеренияЗаказа,
		|	РасширениеВнутреннегоЗаказаТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.РасширениеВнутреннегоЗаказа.Товары КАК РасширениеВнутреннегоЗаказаТовары
		|ГДЕ
		|	РасширениеВнутреннегоЗаказаТовары.Ссылка = &Ссылка
		|	И НЕ (РасширениеВнутреннегоЗаказаТовары.Номенклатура, РасширениеВнутреннегоЗаказаТовары.ДополнительныеХарактеристикиНоменклатуры, РасширениеВнутреннегоЗаказаТовары.ЕдиницаИзмеренияЗаказа) В
		|				(ВЫБРАТЬ
		|					ВнутреннийЗаказТовары.Номенклатура КАК Номенклатура,
		|					ВнутреннийЗаказТовары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
		|					ВнутреннийЗаказТовары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмеренияЗаказа
		|				ИЗ
		|					Документ.ВнутреннийЗаказ.Товары КАК ВнутреннийЗаказТовары
		|				ГДЕ
		|					ВнутреннийЗаказТовары.Ссылка = &Основание
		|					И ВнутреннийЗаказТовары.Ссылка.Проведен)
		|	И РасширениеВнутреннегоЗаказаТовары.Количество < 0";
			
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ТабличнаяЧастьТоварыЗаполненаВерно = Ложь; 
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НомерИДата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание,"Номер, Дата");
			СообщениеПользователю = СтрШаблон("Строка с отрицательным количеством должна присутствовать в ПРОВЕДЕННОМ заказе %1 от %2", НомерИДата.Номер, НомерИДата.Дата);
			ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю,ЭтотОбъект,"Товары[" + XMLСтрока(Выборка.НомерСтроки - 1) + "].Количество");
			
		КонецЦикла;
		
		
	КонецЕсли;  
			
	Возврат ТабличнаяЧастьТоварыЗаполненаВерно;  
		
КонецФункции

Функция ДокуметФормируетОтрицательнуюПотребность()
	
	ДокуметФормируетОтрицательнуюПотребность = Ложь;
	//Проверка на отрицательную потребность    
	
		
	Запрос = Новый Запрос; 
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ВнутреннийЗаказТовары.Ссылка КАК ВнутреннийЗаказ,
	                |	ВнутреннийЗаказТовары.Номенклатура КАК Номенклатура,
	                |	ВнутреннийЗаказТовары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
	                |	ВнутреннийЗаказТовары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмеренияЗаказа,
	                |	ВнутреннийЗаказТовары.Количество КАК Количество
	                |ПОМЕСТИТЬ ВТТовары
	                |ИЗ
	                |	Документ.ВнутреннийЗаказ.Товары КАК ВнутреннийЗаказТовары
	                |ГДЕ
	                |	ВнутреннийЗаказТовары.Количество > 0
	                |	И ВнутреннийЗаказТовары.Ссылка В(&МассивКорректирующихЗаказов)
	                |	И ВнутреннийЗаказТовары.Ссылка.Проведен
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ВнутреннийЗаказТовары.ЗаказДляКорректировки,
	                |	ВнутреннийЗаказТовары.Номенклатура,
	                |	ВнутреннийЗаказТовары.ДополнительныеХарактеристикиНоменклатуры,
	                |	ВнутреннийЗаказТовары.ЕдиницаИзмеренияЗаказа,
	                |	ВнутреннийЗаказТовары.Количество
	                |ИЗ
	                |	Документ.ВнутреннийЗаказ.Товары КАК ВнутреннийЗаказТовары
	                |ГДЕ
	                |	ВнутреннийЗаказТовары.Количество < 0
	                |	И ВнутреннийЗаказТовары.ЗаказДляКорректировки В(&МассивКорректирующихЗаказов)
	                |	И ВнутреннийЗаказТовары.Ссылка.Проведен
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТТовары.ВнутреннийЗаказ КАК ВнутреннийЗаказ,
	                |	ВТТовары.Номенклатура КАК Номенклатура,
	                |	ВТТовары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
	                |	ВТТовары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмеренияЗаказа,
	                |	СУММА(ВТТовары.Количество) КАК Количество
	                |ПОМЕСТИТЬ ВТТоварыСвернутые
	                |ИЗ
	                |	ВТТовары КАК ВТТовары
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТТовары.Номенклатура,
	                |	ВТТовары.ВнутреннийЗаказ,
	                |	ВТТовары.ЕдиницаИзмеренияЗаказа,
	                |	ВТТовары.ДополнительныеХарактеристикиНоменклатуры
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТТоварыСвернутые.ВнутреннийЗаказ.Номер КАК ВнутреннийЗаказНомер,
	                |	ВТТоварыСвернутые.Номенклатура.Представление КАК НоменклатураПредставление,
	                |	ВТТоварыСвернутые.ЕдиницаИзмеренияЗаказа.Представление КАК ЕдиницаИзмеренияЗаказаПредставление,
	                |	ВТТоварыСвернутые.Количество КАК Количество
	                |ИЗ
	                |	ВТТоварыСвернутые КАК ВТТоварыСвернутые
	                |ГДЕ
	                |	ВТТоварыСвернутые.Количество < 0";
	  
		
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		КорректировкиФормируютОтрицательнуюПотребность = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон("В заказе №%1, в строке с номенклатурой 
			| %2 %3 %4
			|формируется отрицательная потребность в количестве %5.",Выборка.ВнутреннийЗаказНомер,
			Выборка.НоменклатураПредставление, Выборка.КоличествоПоЗаявке, Выборка.ЕдиницаИзмеренияПредставление, Выборка.КоличествоПотребности);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЦикла; 
				
	КонецЕсли; 
	
	Возврат ДокуметФормируетОтрицательнуюПотребность;
	
КонецФункции

Процедура ЗаписатьДвиженияВРегистрОстатокПотребностиПоВнутреннимЗаказам(Отказ)
			
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасширениеВнутреннегоЗаказаТовары.Номенклатура КАК Номенклатура,
	|	РасширениеВнутреннегоЗаказаТовары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
	|	РасширениеВнутреннегоЗаказаТовары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмеренияЗаказа,
	|	СУММА(РасширениеВнутреннегоЗаказаТовары.Количество) КАК Количество,
	|	РасширениеВнутреннегоЗаказаТовары.Ссылка.Основание КАК ВнутреннийЗаказ
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РасширениеВнутреннегоЗаказа.Товары КАК РасширениеВнутреннегоЗаказаТовары
	|ГДЕ
	|	РасширениеВнутреннегоЗаказаТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширениеВнутреннегоЗаказаТовары.Номенклатура,
	|	РасширениеВнутреннегоЗаказаТовары.ЕдиницаИзмеренияЗаказа,
	|	РасширениеВнутреннегоЗаказаТовары.ДополнительныеХарактеристикиНоменклатуры,
	|	РасширениеВнутреннегоЗаказаТовары.Ссылка.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
	|	ВТ_Товары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмеренияЗаказа,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка =  Запрос.Выполнить().Выбрать(); 
	
	Движения.ОстатокПотребностиПоВнутреннимЗаказам.Записывать = Истина;
    Движения.Записать();
	
	Движения.ОстатокПотребностиПоВнутреннимЗаказам.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ОстатокПотребностиПоВнутреннимЗаказам.Добавить(); 
		
		Если Выборка.Количество >= 0 Тогда
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;			
			Движение.Количество = Выборка.Количество;
			
		Иначе      
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Количество = - Выборка.Количество;   
			
		КонецЕсли;
		
		Движение.ВнутреннийЗаказ = Основание; 
     	Движение.Период = Дата; 
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.ДополнительныеХарактеристикиНоменклатуры = Выборка.ДополнительныеХарактеристикиНоменклатуры;
		Движение.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияЗаказа;

	КонецЦикла;
	
	Движения.Записать();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(ОстатокПотребностиПоВнутреннимЗаказамОстатки.Номенклатура) КАК НоменклатураПредставление,
	               |	ПРЕДСТАВЛЕНИЕ(ОстатокПотребностиПоВнутреннимЗаказамОстатки.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	               |	-ОстатокПотребностиПоВнутреннимЗаказамОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	РасширениеВнутреннегоЗаказаТовары.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	РегистрНакопления.ОстатокПотребностиПоВнутреннимЗаказам.Остатки(
	               |			&МоментВремени,
	               |			(ВнутреннийЗаказ, Номенклатура, ДополнительныеХарактеристикиНоменклатуры, ЕдиницаИзмерения) В
	               |				(ВЫБРАТЬ
	               |					ВТ_Товары.ВнутреннийЗаказ КАК ВнутреннийЗаказ,
	               |					ВТ_Товары.Номенклатура КАК Номенклатура,
	               |					ВТ_Товары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры,
	               |					ВТ_Товары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмерения
	               |				ИЗ
	               |					ВТ_Товары КАК ВТ_Товары)) КАК ОстатокПотребностиПоВнутреннимЗаказамОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасширениеВнутреннегоЗаказа.Товары КАК РасширениеВнутреннегоЗаказаТовары
	               |		ПО ОстатокПотребностиПоВнутреннимЗаказамОстатки.ВнутреннийЗаказ = РасширениеВнутреннегоЗаказаТовары.Ссылка.Основание
	               |			И ОстатокПотребностиПоВнутреннимЗаказамОстатки.Номенклатура = РасширениеВнутреннегоЗаказаТовары.Номенклатура
	               |			И ОстатокПотребностиПоВнутреннимЗаказамОстатки.ДополнительныеХарактеристикиНоменклатуры = РасширениеВнутреннегоЗаказаТовары.ДополнительныеХарактеристикиНоменклатуры
	               |			И ОстатокПотребностиПоВнутреннимЗаказамОстатки.ЕдиницаИзмерения = РасширениеВнутреннегоЗаказаТовары.ЕдиницаИзмеренияЗаказа
	               |ГДЕ
	               |	ОстатокПотребностиПоВнутреннимЗаказамОстатки.КоличествоОстаток < 0";
	
	
				   
				   Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
				   РезультатЗапроса = Запрос.Выполнить();
				   
				   Если Не РезультатЗапроса.Пустой() Тогда
					   
					   Отказ = Истина;
					   ВыборкаОшибки = РезультатЗапроса.Выбрать();
					   
					   Пока ВыборкаОшибки.Следующий() Цикл
						   
						   ТекстСообщения = СтрШаблон("Ошибка. Номенклатура %1 формирует отрицательную потребность в количестве %2 %3.", ВыборкаОшибки.НоменклатураПредставление, ВыборкаОшибки.КоличествоОстаток,ВыборкаОшибки.ЕдиницаИзмеренияПредставление);
						   ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"Товары[" + XMLСтрока(ВыборкаОшибки.НомерСтроки-1) + "].Количество");
						   
					   КонецЦикла;
					   
					   Возврат;
					   
				   КонецЕсли; 
				   
			   КонецПроцедуры

#КонецОбласти
